[
  {
    "question_text": "What is the name of the main character in Demon Slayer: Kimetsu no Yaiba?",
    "question_type": "multiple_choice",
    "difficulty": "easy",
    "options": [
      { "text": "Tanjiro Kamado", "isCorrect": true },
      { "text": "Zenitsu Agatsuma", "isCorrect": false },
      { "text": "Inosuke Hashibira", "isCorrect": false },
      { "text": "Giyu Tomioka", "isCorrect": false }
    ],
    "explanation": "Tanjiro Kamado is the protagonist of Demon Slayer. He is a kind-hearted boy who becomes a Demon Slayer after his family is attacked by demons."
  },
  {
    "question_text": "Why does Tanjiro decide to become a Demon Slayer?",
    "question_type": "multiple_choice",
    "difficulty": "easy",
    "options": [
      { "text": "To become the strongest swordsman in Japan", "isCorrect": false },
      { "text": "To avenge his family and find a cure for his sister Nezuko", "isCorrect": true },
      { "text": "To earn money for his village", "isCorrect": false },
      { "text": "To follow in his father's footsteps", "isCorrect": false }
    ],
    "explanation": "After a demon slaughtered most of his family, Tanjiro set out to become a Demon Slayer to avenge them and find a way to turn his sister Nezuko, who was transformed into a demon, back into a human."
  },
  {
    "question_text": "What happened to Tanjiro's sister Nezuko?",
    "question_type": "multiple_choice",
    "difficulty": "easy",
    "options": [
      { "text": "She was kidnapped by bandits", "isCorrect": false },
      { "text": "She was turned into a demon", "isCorrect": true },
      { "text": "She became a Hashira", "isCorrect": false },
      { "text": "She ran away from home", "isCorrect": false }
    ],
    "explanation": "Nezuko was turned into a demon by Muzan Kibutsuji during the same attack that killed the rest of the Kamado family. Unlike other demons, she retains some of her human emotions and protects Tanjiro."
  },
  {
    "question_text": "How does Tanjiro protect Nezuko from sunlight while traveling?",
    "question_type": "multiple_choice",
    "difficulty": "easy",
    "options": [
      { "text": "He covers her with a special cloak", "isCorrect": false },
      { "text": "She wears a bamboo muzzle and is carried in a wooden box on his back", "isCorrect": true },
      { "text": "She hides underground during the day", "isCorrect": false },
      { "text": "He uses a breathing technique to create shade", "isCorrect": false }
    ],
    "explanation": "Tanjiro carries Nezuko in a specially made wooden box on his back to shield her from sunlight. She also wears a bamboo muzzle to prevent her from biting anyone."
  },
  {
    "question_text": "What is the name of the organization that fights demons in the series?",
    "question_type": "multiple_choice",
    "difficulty": "easy",
    "options": [
      { "text": "The Hashira Order", "isCorrect": false },
      { "text": "The Demon Slayer Corps", "isCorrect": true },
      { "text": "The Twelve Kizuki", "isCorrect": false },
      { "text": "The Breathing Guild", "isCorrect": false }
    ],
    "explanation": "The Demon Slayer Corps is a centuries-old organization dedicated to protecting humanity from demons. It operates in secret and is not officially recognized by the government."
  },
  {
    "question_text": "Who is the main villain and king of all demons in Demon Slayer?",
    "question_type": "multiple_choice",
    "difficulty": "easy",
    "options": [
      { "text": "Akaza", "isCorrect": false },
      { "text": "Kokushibo", "isCorrect": false },
      { "text": "Muzan Kibutsuji", "isCorrect": true },
      { "text": "Enmu", "isCorrect": false }
    ],
    "explanation": "Muzan Kibutsuji is the first and most powerful demon, as well as the progenitor of almost all other demons. He is the one who killed Tanjiro's family and turned Nezuko into a demon."
  },
  {
    "question_text": "Which two companions regularly travel and fight alongside Tanjiro?",
    "question_type": "multiple_choice",
    "difficulty": "easy",
    "options": [
      { "text": "Giyu Tomioka and Shinobu Kocho", "isCorrect": false },
      { "text": "Zenitsu Agatsuma and Inosuke Hashibira", "isCorrect": true },
      { "text": "Kanao Tsuyuri and Genya Shinazugawa", "isCorrect": false },
      { "text": "Muichiro Tokito and Mitsuri Kanroji", "isCorrect": false }
    ],
    "explanation": "Zenitsu Agatsuma, a cowardly but surprisingly powerful Thunder Breathing user, and Inosuke Hashibira, a wild boar-mask-wearing Beast Breathing user, become Tanjiro's closest companions throughout the series."
  },
  {
    "question_text": "What does Inosuke Hashibira wear on his head?",
    "question_type": "multiple_choice",
    "difficulty": "easy",
    "options": [
      { "text": "A wolf pelt", "isCorrect": false },
      { "text": "A boar's head mask", "isCorrect": true },
      { "text": "A demon skull helmet", "isCorrect": false },
      { "text": "A straw hat", "isCorrect": false }
    ],
    "explanation": "Inosuke wears the hollowed-out head of a boar as a mask. He was raised by boars in the mountains after being abandoned as a baby, and the boar head belonged to his adoptive boar mother."
  },
  {
    "question_text": "What color does Tanjiro's Nichirin sword turn when he first wields it?",
    "question_type": "multiple_choice",
    "difficulty": "easy",
    "options": [
      { "text": "Red", "isCorrect": false },
      { "text": "Blue", "isCorrect": false },
      { "text": "Black", "isCorrect": true },
      { "text": "Green", "isCorrect": false }
    ],
    "explanation": "Tanjiro's Nichirin sword turns black, which is considered a rare and mysterious color. Black blades are said to be unusual, and historically their wielders' fates are largely unknown."
  },
  {
    "question_text": "What is Zenitsu's primary emotional state during battles?",
    "question_type": "multiple_choice",
    "difficulty": "easy",
    "options": [
      { "text": "Uncontrollable rage", "isCorrect": false },
      { "text": "Extreme fear — he often fights while asleep or unconscious", "isCorrect": true },
      { "text": "Calm and collected focus", "isCorrect": false },
      { "text": "Overconfident arrogance", "isCorrect": false }
    ],
    "explanation": "Zenitsu is overwhelmed by fear in battle and often passes out from sheer terror. Ironically, when unconscious, he unleashes his true power and executes his Thunder Breathing techniques with incredible speed and precision."
  },
  {
    "question_text": "What Breathing Style does Tanjiro initially learn and use in combat?",
    "question_type": "multiple_choice",
    "difficulty": "medium",
    "options": [
      { "text": "Flame Breathing", "isCorrect": false },
      { "text": "Water Breathing", "isCorrect": true },
      { "text": "Wind Breathing", "isCorrect": false },
      { "text": "Sun Breathing", "isCorrect": false }
    ],
    "explanation": "Tanjiro first learns Water Breathing from his master Sakonji Urokodaki. He later discovers Hinokami Kagura (Sun Breathing), which was passed down through his family, and begins combining both styles in battle."
  },
  {
    "question_text": "What is the signature technique that Zenitsu is best known for?",
    "question_type": "multiple_choice",
    "difficulty": "medium",
    "options": [
      { "text": "Water Breathing, Second Form: Water Wheel", "isCorrect": false },
      { "text": "Beast Breathing, First Fang: Pierce", "isCorrect": false },
      { "text": "Thunder Breathing, First Form: Thunderclap and Flash", "isCorrect": true },
      { "text": "Flame Breathing, First Form: Unknowing Fire", "isCorrect": false }
    ],
    "explanation": "Zenitsu mastered only the First Form of Thunder Breathing — Thunderclap and Flash — but refined it to an extraordinary degree. This lightning-fast technique allows him to close distances and strike with blinding speed."
  },
  {
    "question_text": "What are the highest-ranked and most elite Demon Slayers called?",
    "question_type": "multiple_choice",
    "difficulty": "medium",
    "options": [
      { "text": "The Twelve Kizuki", "isCorrect": false },
      { "text": "The Kinoe", "isCorrect": false },
      { "text": "The Hashira (Pillars)", "isCorrect": true },
      { "text": "The Breathing Masters", "isCorrect": false }
    ],
    "explanation": "The Hashira, also known as the Pillars, are the nine most powerful swordsmen in the Demon Slayer Corps. Each Hashira specializes in a particular Breathing Style and serves as the Corps' strongest line of defense against demons."
  },
  {
    "question_text": "Who is the Water Hashira that first encounters Tanjiro and Nezuko?",
    "question_type": "multiple_choice",
    "difficulty": "medium",
    "options": [
      { "text": "Kyojuro Rengoku", "isCorrect": false },
      { "text": "Tengen Uzui", "isCorrect": false },
      { "text": "Giyu Tomioka", "isCorrect": true },
      { "text": "Obanai Iguro", "isCorrect": false }
    ],
    "explanation": "Giyu Tomioka, the Water Hashira, is the first Hashira Tanjiro meets. He initially tries to kill Nezuko but is moved by the siblings' bond and instead directs Tanjiro to his former master, Sakonji Urokodaki, to begin training."
  },
  {
    "question_text": "What is the group of Muzan's most powerful demons called?",
    "question_type": "multiple_choice",
    "difficulty": "medium",
    "options": [
      { "text": "The Demon Moons", "isCorrect": false },
      { "text": "The Twelve Kizuki (Twelve Demon Moons)", "isCorrect": true },
      { "text": "The Shadow Demons", "isCorrect": false },
      { "text": "The Blood Demons", "isCorrect": false }
    ],
    "explanation": "The Twelve Kizuki are Muzan's twelve most powerful demons, divided into six Upper Ranks (Upper Moons) and six Lower Ranks (Lower Moons). The Upper Ranks are significantly more powerful and have killed many Hashira over the centuries."
  },
  {
    "question_text": "Who is the Flame Hashira that battles Upper Rank Three Akaza aboard the Mugen Train?",
    "question_type": "multiple_choice",
    "difficulty": "medium",
    "options": [
      { "text": "Giyu Tomioka", "isCorrect": false },
      { "text": "Sanemi Shinazugawa", "isCorrect": false },
      { "text": "Kyojuro Rengoku", "isCorrect": true },
      { "text": "Gyomei Himejima", "isCorrect": false }
    ],
    "explanation": "Kyojuro Rengoku, the passionate and honorable Flame Hashira, fights Upper Rank Three Akaza in a fierce battle aboard and beside the Mugen Train. His bravery and dedication left a lasting impact on Tanjiro and his companions."
  },
  {
    "question_text": "What makes Nezuko unique compared to other demons?",
    "question_type": "multiple_choice",
    "difficulty": "medium",
    "options": [
      { "text": "She can use Breathing techniques like a Demon Slayer", "isCorrect": false },
      { "text": "She doesn't need to eat humans and recovers energy by sleeping instead", "isCorrect": true },
      { "text": "She can speak fluently despite being a demon", "isCorrect": false },
      { "text": "She was born as a demon rather than turned into one", "isCorrect": false }
    ],
    "explanation": "Unlike other demons who must consume human flesh or blood to sustain themselves and grow stronger, Nezuko recovers her energy through sleep. This is extraordinarily rare and is one reason Tanjiro believes she can be turned back into a human."
  },
  {
    "question_text": "What is the name of the hidden village where Demon Slayers' swords are forged?",
    "question_type": "multiple_choice",
    "difficulty": "medium",
    "options": [
      { "text": "The Butterfly Mansion", "isCorrect": false },
      { "text": "The Swordsmith Village", "isCorrect": true },
      { "text": "The Ubuyashiki Estate", "isCorrect": false },
      { "text": "The Infinity Castle", "isCorrect": false }
    ],
    "explanation": "The Swordsmith Village is a secret, hidden location where skilled artisans forge the Nichirin swords used by the Demon Slayer Corps. Its location is kept highly confidential to protect the swordsmiths from demon attacks."
  },
  {
    "question_text": "How many forms does standard Water Breathing have?",
    "question_type": "multiple_choice",
    "difficulty": "medium",
    "options": [
      { "text": "7 forms", "isCorrect": false },
      { "text": "10 forms", "isCorrect": true },
      { "text": "12 forms", "isCorrect": false },
      { "text": "9 forms", "isCorrect": false }
    ],
    "explanation": "Water Breathing has 10 established forms. Tanjiro's former master Sakonji Urokodaki and the Water Hashira Giyu Tomioka both know all 10 forms. Giyu also created an original 11th Form: Dead Calm, which is unique to him."
  },
  {
    "question_text": "Who is the Love Hashira in the Demon Slayer Corps?",
    "question_type": "multiple_choice",
    "difficulty": "medium",
    "options": [
      { "text": "Shinobu Kocho", "isCorrect": false },
      { "text": "Kanao Tsuyuri", "isCorrect": false },
      { "text": "Mitsuri Kanroji", "isCorrect": true },
      { "text": "Nezuko Kamado", "isCorrect": false }
    ],
    "explanation": "Mitsuri Kanroji is the Love Hashira. She uses Love Breathing, a style she derived from Flame Breathing. She possesses a unique muscular composition eight times denser than a normal person's, giving her incredible strength and flexibility."
  },
  {
    "question_text": "What is the name of Upper Moon One, the strongest of the Twelve Kizuki?",
    "question_type": "multiple_choice",
    "difficulty": "hard",
    "options": [
      { "text": "Akaza", "isCorrect": false },
      { "text": "Doma", "isCorrect": false },
      { "text": "Kokushibo", "isCorrect": true },
      { "text": "Hantengu", "isCorrect": false }
    ],
    "explanation": "Kokushibo holds the position of Upper Moon One, making him the most powerful demon under Muzan Kibutsuji. He is an ancient demon who has lived for over 400 years and uses Moon Breathing, a combat style he developed from his human days as a swordsman."
  },
  {
    "question_text": "What was Kokushibo's human name, and what is his relation to the legendary Demon Slayer Yoriichi Tsugikuni?",
    "question_type": "multiple_choice",
    "difficulty": "hard",
    "options": [
      { "text": "Michikatsu Tsugikuni — he was Yoriichi's twin brother", "isCorrect": true },
      { "text": "Hakuji — he was Yoriichi's student", "isCorrect": false },
      { "text": "Sumiyoshi — he was Yoriichi's son", "isCorrect": false },
      { "text": "Kaigaku — he was Yoriichi's rival from another clan", "isCorrect": false }
    ],
    "explanation": "Kokushibo was born as Michikatsu Tsugikuni, the twin brother of Yoriichi Tsugikuni, the strongest Demon Slayer in history. Consumed by jealousy of his brother's unmatched talent, Michikatsu eventually accepted Muzan's blood and became a demon to surpass the limits of human life."
  },
  {
    "question_text": "What is the original Breathing Style from which all other Breathing Styles are derived?",
    "question_type": "multiple_choice",
    "difficulty": "hard",
    "options": [
      { "text": "Water Breathing", "isCorrect": false },
      { "text": "Flame Breathing", "isCorrect": false },
      { "text": "Moon Breathing", "isCorrect": false },
      { "text": "Sun Breathing, created by Yoriichi Tsugikuni", "isCorrect": true }
    ],
    "explanation": "Sun Breathing (Hinokami Kagura) is the first and most powerful Breathing Style, created by Yoriichi Tsugikuni during the Sengoku era. All other Breathing Styles — Water, Flame, Wind, Thunder, and Stone — are derived from Sun Breathing, adapted by swordsmen who couldn't master the original."
  },
  {
    "question_text": "Which Hashira and Demon Slayers fought together against Upper Moon One Kokushibo?",
    "question_type": "multiple_choice",
    "difficulty": "hard",
    "options": [
      { "text": "Giyu Tomioka, Shinobu Kocho, Mitsuri Kanroji, and Obanai Iguro", "isCorrect": false },
      { "text": "Gyomei Himejima, Sanemi Shinazugawa, Muichiro Tokito, and Genya Shinazugawa", "isCorrect": true },
      { "text": "Tengen Uzui, Kyojuro Rengoku, Tanjiro Kamado, and Zenitsu Agatsuma", "isCorrect": false },
      { "text": "Obanai Iguro, Mitsuri Kanroji, Tanjiro Kamado, and Inosuke Hashibira", "isCorrect": false }
    ],
    "explanation": "The battle against Upper Moon One Kokushibo required four fighters: Stone Hashira Gyomei Himejima, Wind Hashira Sanemi Shinazugawa, Mist Hashira Muichiro Tokito, and Genya Shinazugawa. It was one of the most devastating battles, showcasing Kokushibo's overwhelming power."
  },
  {
    "question_text": "What is the correct order of the Demon Slayer Corps ranking system from lowest to highest?",
    "question_type": "multiple_choice",
    "difficulty": "hard",
    "options": [
      { "text": "Kinoe, Kinoto, Hinoe, Hinoto, Tsuchinoe, Tsuchinoto, Kanoe, Kanoto, Mizunoe, Mizunoto", "isCorrect": false },
      { "text": "Mizunoto, Mizunoe, Kanoto, Kanoe, Tsuchinoto, Tsuchinoe, Hinoto, Hinoe, Kinoto, Kinoe", "isCorrect": true },
      { "text": "Mizunoe, Mizunoto, Kanoe, Kanoto, Tsuchinoe, Tsuchinoto, Hinoe, Hinoto, Kinoe, Kinoto", "isCorrect": false },
      { "text": "Kinoto, Kinoe, Hinoto, Hinoe, Tsuchinoto, Tsuchinoe, Kanoto, Kanoe, Mizunoto, Mizunoe", "isCorrect": false }
    ],
    "explanation": "The Demon Slayer Corps uses a ten-level ranking system based on the Heavenly Stems (Jikkan). From lowest to highest: Mizunoto, Mizunoe, Kanoto, Kanoe, Tsuchinoto, Tsuchinoe, Hinoto, Hinoe, Kinoto, and Kinoe. New slayers start at Mizunoto after passing Final Selection."
  },
  {
    "question_text": "What is Muzan's blood curse and how does it control demons?",
    "question_type": "multiple_choice",
    "difficulty": "hard",
    "options": [
      { "text": "It allows him to read all demons' minds at any time", "isCorrect": false },
      { "text": "Demons who speak Muzan's name or reveal information about him can be destroyed by the curse in his blood", "isCorrect": true },
      { "text": "It forces demons to return to Muzan every full moon", "isCorrect": false },
      { "text": "It gives Muzan the ability to control demons like puppets at will", "isCorrect": false }
    ],
    "explanation": "Muzan's blood contains a powerful curse. Demons who have received his blood are unable to speak his name or divulge critical information about him to others — doing so triggers the curse, which can destroy the demon from within. This is how Muzan maintains control and secrecy over his demon army."
  },
  {
    "question_text": "What is the Demon Slayer Mark, and what is the major drawback of manifesting one?",
    "question_type": "multiple_choice",
    "difficulty": "hard",
    "options": [
      { "text": "A mark that makes the wielder immune to demon poison, but causes blindness over time", "isCorrect": false },
      { "text": "A mark that greatly enhances physical abilities, but bearers typically die before reaching the age of 25", "isCorrect": true },
      { "text": "A mark that allows communication with other slayers, but slowly erases memories", "isCorrect": false },
      { "text": "A mark that increases sword sharpness, but causes the wielder's sword to eventually shatter", "isCorrect": false }
    ],
    "explanation": "The Demon Slayer Mark is a special marking that appears on talented Demon Slayers, dramatically boosting their physical abilities, reaction speed, and strength. However, it comes at a terrible cost — every known bearer of the mark has died before turning 25, with Yoriichi Tsugikuni being the sole exception."
  },
  {
    "question_text": "What special materials are Nichirin swords forged from, and why are they effective against demons?",
    "question_type": "multiple_choice",
    "difficulty": "hard",
    "options": [
      { "text": "Scarlet Crimson Iron Sand and Scarlet Crimson Ore from mountains closest to the sun, which absorb sunlight", "isCorrect": true },
      { "text": "Meteoric iron blessed by shrine priests during a solar eclipse", "isCorrect": false },
      { "text": "Steel mixed with the blood of ancient Hashira warriors", "isCorrect": false },
      { "text": "Enchanted copper mined from caves where demons were first sealed away", "isCorrect": false }
    ],
    "explanation": "Nichirin swords are forged from Scarlet Crimson Iron Sand and Scarlet Crimson Ore, materials found on high-altitude mountains that receive enormous amounts of sunlight year-round. Because these ores have absorbed sunlight, the blades are one of the few weapons capable of killing demons, essentially channeling the power of the sun."
  },
  {
    "question_text": "What is the true origin of the Hinokami Kagura (Dance of the Fire God) that Tanjiro's family passed down for generations?",
    "question_type": "multiple_choice",
    "difficulty": "hard",
    "options": [
      { "text": "It was a Fire Breathing technique taught to charcoal burners by the Flame Hashira", "isCorrect": false },
      { "text": "It is a corrupted form of Sun Breathing, passed from Yoriichi to the Kamado family ancestor and preserved as a ritual dance", "isCorrect": true },
      { "text": "It was created by Tanjiro's great-grandfather who was once a Demon Slayer", "isCorrect": false },
      { "text": "It is an entirely original technique developed by the Kamado family's charcoal-burning practice", "isCorrect": false }
    ],
    "explanation": "The Hinokami Kagura is actually a form of Sun Breathing, the original and most powerful Breathing Style. Yoriichi Tsugikuni befriended Tanjiro's ancestor Sumiyoshi and showed him the forms of Sun Breathing. The Kamado family preserved these techniques across generations as a ceremonial dance performed each New Year, unknowingly keeping the lost art of Sun Breathing alive."
  },
  {
    "question_text": "How does Nezuko eventually conquer the sun, and why does this make her so important to Muzan?",
    "question_type": "multiple_choice",
    "difficulty": "hard",
    "options": [
      { "text": "She uses a special breathing technique to filter sunlight, making Muzan want to learn it", "isCorrect": false },
      { "text": "She develops natural immunity to sunlight, making Muzan obsessed with devouring her to gain the same ability", "isCorrect": true },
      { "text": "She wears enchanted armor forged from Nichirin ore that blocks sunlight", "isCorrect": false },
      { "text": "She merges with a Hashira's blood to neutralize sunlight, which Muzan wants to replicate", "isCorrect": false }
    ],
    "explanation": "Nezuko spontaneously develops complete immunity to sunlight, becoming the first demon in history to conquer the sun. This makes her Muzan's ultimate target — for over a thousand years, Muzan has desperately sought a way to overcome his vulnerability to sunlight, and devouring Nezuko could grant him that ability, making him truly invincible."
  }
]
